package lesson6.task2_3_5;

/**
 * 1. Створіть клас InitTest2 із приватним полем id типу int і статичним приватним полем nextId типу int.
 * 2. Напишіть код, який:
 * - ініціалізує статичне поле nextId деяким випадковим значенням (в діапазоні 1 … 1000) один раз при завантаженні класу в JVM;
 * - збільшує статичне поле nextId кожного разу, коли створюється новий екземпляр InitTest;
 * - ініціалізує поле id значенням поля nextId кожного разу, коли створюється об'єкт класу
 * 3. Додайте до класу геттер поля id.
 * 4. Розробіть клас Main з методом main, який створить п’ять екземплярів класу InitTest2 і викличе геттер поля id для кожного екземпляра та виведе повернуте значення до консолі.
 * 5. Зазначте у документованому коментарі класів їх призначеня, а також своє ім'я та прізвище.
 *
 * @version 1.1
 * @autor Olha Nozdriukhina
 */

/**
 * Клас InitTest2 представляє клас із приватним полем 'id' типу int та статичним приватним полем 'nextId' типу int
 * Клас ініціалізує статичне поле 'nextId' деяким випадковим значенням
 * Клас збільшує статичне поле 'nextId' кожного разу, коли створюється новий екземпляр InitTest2
 */

public class InitTest2 {
    private int id;
    private static int nextId;

    static {
        nextId = (int) (Math.random() * 1000) + 1;
    }

    public InitTest2() {
        this.id = nextId;
        nextId++;
    }

    public int getId() {
        return id;
    }
}

