package lesson6.task2_3_4;

import java.util.Random;

/**
 * 1. Створіть клас MyInit із полем arr, яке посилається на масив 10 цілих чисел і нестатичним блоком ініціалізації, який ініціалізує цей масив випадковими значеннями від 1 до 100.
 * 2. Додайте до класу MyInit і метод printArray(), який друкуватиме значення цього масиву.
 * 3. Створіть клас Main з методом main, який створить два екземпляри класу MyInit і викличе метод printArray() для виведення значень їхніх масивів до консолі.
 * 4. Зробіть поле arr статичним. Виконайте компіляцію програми. Напишіть у коментарі, що Ви бачите та чому.
 * 5. Залиште поле arr статичним. Зробіть блок ініціалізації статичним. Виконайте компіляцію програми. Напишіть у коментарі, що Ви бачите та чому.
 * 6. Зазначте у документованому коментарі класів їх призначеня, а також своє ім'я та прізвище.
 *
 * @version 1.1
 * @autor Olha Nozdriukhina
 */

/**
 * Клас MyInit із полем arr, яке посилається на масив 10 цілих чисел і нестатичним блоком ініціалізації,
 * який ініціалізує цей масив випадковими значеннями від 1 до 100.
 */
public class MyInit {
    static int[] arr;

    static {
        arr = new int[10];
        Random random = new Random();
        for (int i = 0; i < arr.length; i++) {
            arr[i] = random.nextInt(100) + 1;
        }
    }

    /**
     * Метод printArray() друкує значення масиву arr до консолі.
     */
    public void printArray() {
        for (int value : arr) {
            System.out.print(value + " ");
        }
        System.out.println();
    }
}

